ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduino/pins_arduino.h
/* pins_arduino.h - Variant definition for the UkiUkiduino (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of UkiUkiCore (a product-specific fork of WazamonoCore / SpenceKonde's
 * DxCore). DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see
 * LICENSE.md), based on existing Arduino cores. This variant (C) Workshop
 * Asahi 2026.
 *
 * Board   : UkiUkiduino (Arduino Uno R3 form factor, AVR64DU32-I/PT, USB-C)
 * MCU     : AVR64DU32  (32-pin TQFP)
 * Clock   : CRYSTAL-LESS. Internal OSCHF fixed at 24 MHz (boards.txt sets
 *           build.clocksource=0, no Clock menu). PA0/PA1 are therefore plain
 *           GPIO on this board and are mapped to D7 / D20.
 *           USB CLK_USB (48 MHz) is produced by OSCHF + PLL48M and is
 *           auto-tuned to the USB SOF, independently of the system clock.
 *
 *  ===== Pin numbering: Arduino Uno R3 compatible (NONCANONICAL) =====
 *   D#   MCU   Uno R3 role / notes                          A#,  AIN
 *   D0   PA5   RX  (Serial0 / USART0 RX, ALT1)              A6,  AIN25
 *   D1   PA4   TX  (Serial0 / USART0 TX, ALT1)              A7,  AIN24
 *   D2   PA6   (USART0 XCK, ALT1)                           A8,  AIN26
 *   D3   PF5   ~PWM(TCB1, ALT1)                             A9,  AIN21
 *   D4   PF4   (general I/O; no PWM - TCB0 is millis)       A10, AIN20
 *   D5   PD0   ~PWM(TCA0 WO0) | CCL                         A11, AIN0
 *   D6   PD1   ~PWM(TCA0 WO1) | CCL                         A12, AIN1
 *   D7   PC3   AC0 AINP4 | CCL LUT1-OUT                   A13, AIN31
 *   D8   PA7   (general I/O, native 5V)                     A14, AIN27
 *   D9   PD2   ~PWM(TCA0 WO2) | CCL | AC0 AINP0 | EVOUTD    A15, AIN2
 *   D10  PD3   ~PWM(TCA0 WO3) | CCL | AC0 AINN0 | (SS)      A16, AIN3
 *   D11  PD4   ~PWM(TCA0 WO4) | SPI MOSI                    A17, AIN4
 *   D12  PD5   ~PWM(TCA0 WO5) | SPI MISO                    A18, AIN5
 *   D13  PD6   SPI SCK | LED_BUILTIN (mirrored onto PC3)    A19, AIN6
 *   D14  PF0   A0 | CCL                                     A0,  AIN16
 *   D15  PF1   A1 | CCL                                     A1,  AIN17
 *   D16  PF2   A2 | CCL | EVOUTF                            A2,  AIN18
 *   D17  PF3   A3 | CCL                                     A3,  AIN19
 *   D18  PA2   A4 | SDA (I2C)                               A4,  AIN22
 *   D19  PA3   A5 | SCL (I2C)                               A5,  AIN23
 *   D20  PA1   BTN_BUILTIN (on-board button, external 1k pull-down,
 *              pressed = HIGH; no header pin)
 *   --- not exposed as a numbered Dn (appended so the arrays are complete) ---
 *        PA0   BUILTIN_LED driver (software mirror of D13 writes; no ADC)
 *                                                           index 21
 *        PD7   AREF header pin = VREFA (external analog reference; AIN7)
 *                                                           index 22
 *        PF6   RESET                                        index 23
 *        PF7   UPDI (Power header pin 1)                    index 24  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTD (WO0..WO5 = PD0,PD1,PD2,PD3,PD4,PD5 = D5,D6,D9,D10,D11,D12)
 *   TCB1  -> ALT1 (PF5 = D3)  : ~PWM on D3 (shared with tone(), see below)
 *   millis-> TCB0 : boards.txt passes -DMILLIS_USE_TIMERB0, so TCB1 is free for D3.
 *   tone()-> TCB1 : Tone.cpp auto-selects TCB1 when millis is on TCB0. tone() and
 *           D3 PWM share TCB1, so calling tone() suspends D3 PWM only; D11 PWM
 *           (TCA0) and millis (TCB0) keep running (cf. Uno R3 Timer2 = D3+D11).
 *   SPI0  -> ALT4 (PD4 MOSI / PD5 MISO / PD6 SCK = D11/D12/D13). Board is SPI host;
 *           default CS exposed as PIN_SPI_SS = PD3 (D10, Uno convention). The ALT4
 *           hardware SS is PD7 (= AREF); run SPI host with Client Select Disable
 *           (SPI0.CTRLB.SSD = 1) so the AREF level cannot flip host -> client mode.
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D18/D19 = A4/A5 (Uno I2C convention).
 *   USART0-> "Serial1" (alias of Serial0), ALT1 (PA4 TX / PA5 RX) = D1/D0.
 *           (The Uno R3 D0/D1 UART.)
 *           The DEFAULT mux position (PA0/PA1) is the LED driver / BTN_BUILTIN
 *           on this board - do NOT Serial1.swap(0); ALT1 stays the variant
 *           default so D0/D1 behave like the classic Uno UART.
 *   USART1-> exists on the AVR DU but has NO usable pin position on UkiUkiduino
 *           (DU USART1 is only PD6/PD7, which are SPI SCK / AREF here). Its
 *           object is omitted and "Serial1" is a linker alias of Serial0
 *           (WAZAMONO_SERIAL1_IS_USART0, set in boards.txt; see below).
 *   AREF  -> PD7 = VREFA is wired to the Uno R3 AREF header pin, so
 *           analogReference(EXTERNAL) IS supported on this board.
 *   LED   -> on-board LED is a WS2812D-F5 addressable RGB LED, data-in on PA0.
 *           digitalWrite()/digitalWriteFast() to D13 (PD6) are SOFTWARE-mirrored:
 *           the core reads the resulting PD6 OUT bit and sends the matching
 *           WS2812 frame on PA0 (HIGH = lit in the current color - yellow by
 *           default, LOW = off), so the stock Blink sketch works unmodified.
 *           setLEDColor()/setLEDBrightness() (below) change the lit color.
 *           Only software writes are mirrored - SPI (SCK) traffic does NOT
 *           blink the LED (a deliberate difference from the Uno R3), and
 *           direct register writes to PORTD are not mirrored. Each mirrored
 *           write costs ~340 us (280 us WS2812 latch guard + 31 us frame).
 *   BUTTON-> BTN_BUILTIN = D20 (PA1). External 1 kOhm pull-down on the board;
 *           pressed = HIGH. Use pinMode(BTN_BUILTIN, INPUT) - no pullup needed.
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: the Uno R3 D0/D1 UART is wired to USART0 on this board. The
 *   USART1 object is suppressed and "Serial1" is aliased to USART0, so users
 *   reach the D0/D1 hardware UART as "Serial1" (Uno-family convention;
 *   "Serial0" refers to the same object). "Serial" is the native USB CDC
 *   (serial monitor), so day-to-day Serial.print() behaves exactly like a
 *   classic Uno; use "Serial1" only to talk to an external device on D0/D1.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

