ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduino/pins_arduino.h
/* Informational pinout tags. DU_32PIN_PINOUT keeps DU-32 feature assumptions in
 * the core; UKIUKIDUINO_PINOUT identifies this board. NONCANONICAL_PIN_NUMBERS
 * tells the core to derive (port,bit) from the tables below instead of assuming
 * pin number == port order (our numbering does not follow port order). */
#define DU_32PIN_PINOUT
#define UKIUKIDUINO_PINOUT
/* Board tag for the bundled Wazamono-family libraries (AnalogComp,
 * CustomLogic, EventSystem): selects the UkiUkiduino pin mapping, which for
 * these peripherals matches the Wazamono Tsurugi (PD/PF/PA7/PC3 layout). */
#define WAZAMONO_BOARD_UKIUKIDUINO
#define NONCANONICAL_PIN_NUMBERS

/* ---- Digital pin number for each MCU pin (Uno R3 layout, D0..D20 contiguous) ---- */
#define PIN_PA5 (0)   // D0  RX  (USART0 RX, ALT1)
#define PIN_PA4 (1)   // D1  TX  (USART0 TX, ALT1)
#define PIN_PA6 (2)   // D2  (USART0 XCK)
#define PIN_PF5 (3)   // D3  ~PWM(TCB1, ALT1)
#define PIN_PF4 (4)   // D4  general I/O (no PWM: TCB0 = millis)
#define PIN_PD0 (5)   // D5  TCA0 WO0
#define PIN_PD1 (6)   // D6  TCA0 WO1
#define PIN_PC3 (7)   // D7  A13/AIN31, AC0 AINP4, CCL LUT1-OUT
#define PIN_PA7 (8)   // D8  general I/O (native 5V)
#define PIN_PD2 (9)   // D9  TCA0 WO2
#define PIN_PD3 (10)  // D10 TCA0 WO3 / SS (Uno convention, SSD=1)
#define PIN_PD4 (11)  // D11 TCA0 WO4 / SPI MOSI
#define PIN_PD5 (12)  // D12 TCA0 WO5 / SPI MISO
#define PIN_PD6 (13)  // D13 SPI SCK / LED_BUILTIN (mirrored to PC3 via CCL)
#define PIN_PF0 (14)  // D14 A0
#define PIN_PF1 (15)  // D15 A1
#define PIN_PF2 (16)  // D16 A2
#define PIN_PF3 (17)  // D17 A3
#define PIN_PA2 (18)  // D18 A4 / SDA
#define PIN_PA3 (19)  // D19 A5 / SCL
#define PIN_PA1 (20)  // D20 BTN_BUILTIN (on-board button; no ADC channel)
#define PIN_PA0 (21)  // WS2812D-F5 LED data-in (driven by the D13 software mirror); no ADC; no Dn alias
#define PIN_PD7 (22)  // AREF header pin = VREFA (external reference; AIN7); no Dn alias
#define PIN_PF6 (23)  // RESET
#define PIN_PF7 (24)  // UPDI (Power header pin 1; highest index -> NUM_DIGITAL_PINS = 25)

/* ---- Counts ---- */
#define PINS_COUNT                     (25)  // length of the pin tables (incl. reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 25
// NUM_INTERNALLY_USED_PINS           -> auto = 0 (internal clock; no crystal pins)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD6)   // D13, on-board LED (Uno convention)
#endif
#if !defined(BTN_BUILTIN)
  #define BTN_BUILTIN                  (PIN_PA1)   // D20, on-board button (pull-down, pressed = HIGH)
#endif

/* ---- LED_BUILTIN software mirror (see wiring_digital.c) ----
 * digitalWrite()/digitalWriteFast() on D13 (PD6) also call the hook below,
 * which reads the RESULTING PD6 OUT bit (so HIGH/LOW/CHANGE all mirror
 * correctly) and sends the matching WS2812 frame on PA0: HIGH = lit in the
 * current color (default: yellow), LOW = off. Implemented in
 * ukiukiduino_led.cpp. SPI SCK traffic and direct register writes are
 * intentionally NOT mirrored.
 * TIMING: each mirrored write busy-waits the WS2812 frame-latch time
 * (RES > 280 us, WS2812D-F5 datasheet) and then streams the 24-bit frame
 * with interrupts briefly disabled (~31 us). digitalWrite(13) therefore
 * takes ~340 us - fine for Blink-style use, but do not bit-bang fast
 * protocols on D13 (it is the SPI SCK pin anyway; hardware SPI is not
 * affected because SCK traffic is not mirrored). */
#define LED_BUILTIN_MIRROR
#define LED_MIRROR_SRC_PIN             (PIN_PD6)   /* D13 */

#ifdef __cplusplus
extern "C" void __led_builtin_mirror_hook(void);
#else
void __led_builtin_mirror_hook(void);
#endif

#ifdef __cplusplus
/* ---- On-board LED color API (WS2812D-F5 on PA0) ----
 * The LED still follows D13 like a classic Uno: digitalWrite(LED_BUILTIN,
 * HIGH/LOW) = lit/off. These functions change WHAT "lit" looks like:
 *
 *   setLEDColor(r, g, b);        8-bit RGB components
 *   setLEDColor(Yellow);         named color (see LEDColorName)
 *   setLEDBrightness(level);     0-255 overall brightness (default 40)
 *
 * If the LED is currently lit (D13 OUT is HIGH) the change is applied
 * immediately; otherwise it takes effect at the next digitalWrite(13, HIGH).
 * Power-on defaults: Yellow, brightness 40 (the Uno "L"-LED look). */
enum LEDColorName : uint8_t {
  Red, Green, Blue, Yellow, Orange, Cyan, Magenta, Purple, Pink, White
};
void setLEDColor(uint8_t r, uint8_t g, uint8_t b);
void setLEDColor(LEDColorName color);
void setLEDBrightness(uint8_t brightness);
#endif

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ----
 * PA0 (LED driver) and PA1 (D20) have no ADC channel on the AVR DU and are
 * therefore absent from these maps (-> NOT_A_PIN). D7 (PC3) maps to AIN31 (A13).
 * PD7 (AREF) keeps its AIN7 mapping so the pin can still be sampled when it is
 * not used as the external reference. */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

